2025-fin-graduate-project/Falling-Detection-STM32/Application/STM32N6570-DK/Src/main.c
 /**
 ******************************************************************************
 * @file    main.c
 * @author  GPM Application Team
 *
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2023 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
#include <string.h>
#include <unistd.h>
#include <math.h>

#include "cmw_camera.h"
#include "stm32n6570_discovery_bus.h"
#include "stm32n6570_discovery_lcd.h"
#include "stm32n6570_discovery_xspi.h"
#include "stm32n6570_discovery.h"
#include "stm32_lcd.h"
#include "app_fuseprogramming.h"
#include "stm32_lcd_ex.h"
#include "app_postprocess.h"
#include "stai.h"
#include "stai_network.h"
#if FALL_DETECTION_MODEL == FALL_MODEL_GRU
#include "gru_network.h"
#else
#include "stai_tcn_network.h"
#endif
#include "app_camerapipeline.h"
#include "main.h"
#include <stdio.h>
#include "app_config.h"
#include "pose_pipeline.h"
#include "crop_img.h"
#include "stlogo.h"
#include "utils.h"
#if POSTPROCESS_TYPE == POSTPROCESS_MPE_YOLO_V8_UI
  #include "display_mpe.h"
#elif POSTPROCESS_TYPE == POSTPROCESS_SPE_MOVENET_UI
  #include "display_spe.h"
#else
  #error "PostProcessing type not supported"
#endif

#define LCD_FG_WIDTH  SCREEN_WIDTH
#define LCD_FG_HEIGHT SCREEN_HEIGHT
#define LCD_FG_FRAMEBUFFER_SIZE  (LCD_FG_WIDTH * LCD_FG_HEIGHT * 2)

#ifndef APP_GIT_SHA1_STRING
#define APP_GIT_SHA1_STRING "dev"
#endif
#ifndef APP_VERSION_STRING
#define APP_VERSION_STRING "unversioned"
#endif


typedef struct
{
  uint32_t X0;
  uint32_t Y0;
  uint32_t XSize;
  uint32_t YSize;
} Rectangle_TypeDef;

typedef struct
{
  int8_t raw_min;
  int8_t raw_max;
  float32_t raw_min_dequant;
  float32_t raw_max_dequant;
  float32_t max_keypoint_proba;
  uint32_t visible_keypoints;
  uint32_t person_keypoints;
  uint32_t person_missing_count;
  uint32_t person_entry_count;
  uint8_t person_present;
  uint8_t person_present_confirmed;
  uint8_t person_missing_confirmed;
  uint8_t postprocess_valid;
  uint8_t draw_keypoints;
  uint32_t output_width;
  uint32_t output_height;
  uint32_t output_channels;
  int32_t postprocess_status;
} PoseDebugMetrics_TypeDef;

typedef struct
{
  uint8_t window_ready;
  uint8_t fall_detected;
  uint32_t frame_count;
  uint32_t inference_ms;
  float32_t normal_logit;
  float32_t fall_logit;
  float32_t normal_score;
  float32_t fall_score;
  uint32_t fall_consec_count; /* consecutive fall frames; resets GRU on threshold */
  uint32_t fall_latch_tick;   /* HAL tick of last confirmed fall; 0 if never */
} FallDetectionState_TypeDef;

/* Lcd Background area */
Rectangle_TypeDef lcd_bg_area = {
#if ASPECT_RATIO_MODE == ASPECT_RATIO_CROP || ASPECT_RATIO_MODE == ASPECT_RATIO_FIT
  .X0 = (LCD_FG_WIDTH - LCD_FG_HEIGHT) / 2,
#else
  .X0 = 0,
#endif
  .Y0 = 0,
  .XSize = 0,
  .YSize = 0,
};

/* Lcd Foreground area */
Rectangle_TypeDef lcd_fg_area = {
  .X0 = 0,
  .Y0 = 0,
  .XSize = LCD_FG_WIDTH,
  .YSize = LCD_FG_HEIGHT,
};

#if POSTPROCESS_TYPE == POSTPROCESS_MPE_YOLO_V8_UI
  mpe_yolov8_pp_static_param_t pp_params;
  mpe_pp_out_t pp_output;
#elif POSTPROCESS_TYPE == POSTPROCESS_SPE_MOVENET_UI
  spe_movenet_pp_static_param_t pp_params;
  spe_pp_out_t pp_output;
#else
  #error "PostProcessing type not supported"
#endif

BINDINGS;

UART_HandleTypeDef huart1;
volatile int32_t cameraFrameReceived;
stai_ptr nn_in;
BSP_LCD_LayerConfig_t LayerConfig = {0};

#define ALIGN_TO_16(value) (((value) + 15) & ~15)

/* for models not multiple of 16; needs a working buffer */
#if (STAI_NETWORK_IN_1_WIDTH * STAI_NETWORK_IN_1_CHANNEL) != ALIGN_TO_16(STAI_NETWORK_IN_1_WIDTH * STAI_NETWORK_IN_1_CHANNEL)
#define DCMIPP_OUT_NN_LEN (ALIGN_TO_16(STAI_NETWORK_IN_1_WIDTH * STAI_NETWORK_IN_1_CHANNEL) * STAI_NETWORK_IN_1_HEIGHT)
#define DCMIPP_OUT_NN_BUFF_LEN (DCMIPP_OUT_NN_LEN + 32 - DCMIPP_OUT_NN_LEN%32)

__attribute__ ((aligned (32)))
uint8_t dcmipp_out_nn[DCMIPP_OUT_NN_BUFF_LEN];
#else
uint8_t *dcmipp_out_nn;
#endif

/* MoveNet model context */
STAI_NETWORK_CONTEXT_DECLARE(network_context, STAI_NETWORK_CONTEXT_SIZE)
/* Fall detection model context */
#if FALL_DETECTION_MODEL == FALL_MODEL_GRU
STAI_NETWORK_CONTEXT_DECLARE(gru_network_context, STAI_GRU_NETWORK_CONTEXT_SIZE)
#else
STAI_NETWORK_CONTEXT_DECLARE(tcn_network_context, STAI_TCN_NETWORK_CONTEXT_SIZE)
#endif
/* Lcd Background Buffer */
__attribute__ ((section (".psram_bss")))
__attribute__ ((aligned (32)))
static uint8_t lcd_bg_buffer[800 * 480 * 2];
/* Lcd Foreground Buffer */
__attribute__ ((section (".psram_bss")))
__attribute__ ((aligned (32)))
static uint8_t lcd_fg_buffer[2][LCD_FG_WIDTH * LCD_FG_HEIGHT * 2];
static int lcd_fg_buffer_rd_idx;
static PoseDebugMetrics_TypeDef pose_debug_metrics;
static FallDetectionState_TypeDef fall_state;
static PosePipeline_t pose_pipeline;
static uint32_t pose_last_tick;
#if FALL_DETECTION_MODEL == FALL_MODEL_GRU
/* GRU stateful: 3 inputs [h1, h2, pose], 3 outputs [new_h1, logits, new_h2] */
static stai_ptr gru_in[STAI_GRU_NETWORK_IN_NUM]   = {0};
static stai_ptr gru_out[STAI_GRU_NETWORK_OUT_NUM]  = {0};
static int32_t  gru_in_len[STAI_GRU_NETWORK_IN_NUM]  = {0};
static int32_t  gru_out_len[STAI_GRU_NETWORK_OUT_NUM] = {0};
/* Hidden state buffers — persistent across frames */
__attribute__((aligned(32))) static float32_t gru_h1[64] = {0};
__attribute__((aligned(32))) static float32_t gru_h2[32] = {0};
/* Activation scratch buffer — required because g_gru_network_activations_1 is NULL in generated code */
__attribute__((aligned(4))) static uint8_t gru_activation_buf[STAI_GRU_NETWORK_ACTIVATION_1_SIZE];
#else
static stai_ptr tcn_in;
static stai_ptr tcn_out[STAI_TCN_NETWORK_OUT_NUM] = {0};
static int32_t tcn_out_len[STAI_TCN_NETWORK_OUT_NUM] = {0};
#endif

static void SystemClock_Config(void);
static void CONSOLE_Config(void);
static void NPURam_enable(void);
static void NPUCache_config(void);
static void Display_NetworkOutput(void *p_postprocess, uint32_t inference_ms);
static void LCD_init(void);
static void Security_Config(void);
static void set_clk_sleep_mode(void);
static void IAC_Config(void);
static void Display_WelcomeScreen(void);
static void Hardware_init(void);
static void Run_Inference(stai_network *network_instance);
static void NeuralNetwork_init(uint32_t *nn_in_length, stai_ptr *nn_out, stai_size *number_output, int32_t nn_out_len[]);
static void Update_PoseDebugMetrics(stai_ptr *nn_out, int32_t nn_out_len[], stai_size number_output, spe_pp_out_t *p_postprocess);
static void FallModel_init(void);
static void Run_FallInference(void);
static void FallDetection_Update(PosePipeline_t *pipeline);
static void FallDetection_Invalidate(PosePipeline_t *pipeline);


/**
  * @brief  Main program
  * @param  None
  * @retval None
  */
int main(void)
{
  Hardware_init();

  /*** App header *************************************************************/
  printf("========================================\n");
  printf("STM32N6-GettingStarted-PoseEstimation %s (%s)\n", APP_VERSION_STRING, APP_GIT_SHA1_STRING);
  printf("Build date & time: %s %s\n", __DATE__, __TIME__);
  #if defined(__GNUC__)
  printf("Compiler: GCC %d.%d.%d\n", __GNUC__, __GNUC_MINOR__, __GNUC_PATCHLEVEL__);
#elif defined(__ICCARM__)
  printf("Compiler: IAR EWARM %d.%d.%d\n", __VER__ / 1000000, (__VER__ / 1000) % 1000 ,__VER__ % 1000);
#else
  printf("Compiler: Unknown\n");
#endif
  printf("HAL: %lu.%lu.%lu\n", __STM32N6xx_HAL_VERSION_MAIN, __STM32N6xx_HAL_VERSION_SUB1, __STM32N6xx_HAL_VERSION_SUB2);
  printf("STEdgeAI Tools: %d.%d.%d\n", STAI_TOOLS_VERSION_MAJOR, STAI_TOOLS_VERSION_MINOR, STAI_TOOLS_VERSION_MICRO);
  printf("NN model: %s\n", STAI_NETWORK_ORIGIN_MODEL_NAME);
#if FALL_DETECTION_MODEL == FALL_MODEL_GRU
  printf("Fall model: %s\n", STAI_GRU_NETWORK_ORIGIN_MODEL_NAME);
#else
  printf("Fall model: %s\n", STAI_TCN_NETWORK_ORIGIN_MODEL_NAME);
#endif
  printf("========================================\n");

  /*** NN Init ****************************************************************/
  uint32_t pitch_nn = 0;
  uint32_t nn_in_len = 0;
  stai_size number_output = 0;
  stai_ptr nn_out[STAI_NETWORK_OUT_NUM] = {0};
  int32_t nn_out_len[STAI_NETWORK_OUT_NUM] = {0};

  NeuralNetwork_init(&nn_in_len, nn_out, &number_output, nn_out_len);
  FallModel_init();

  /*** Post Processing Init ***************************************************/
  stai_network_info info;
  int ret;

  ret = stai_network_get_info(network_context, &info);
  assert(ret == STAI_SUCCESS);
  app_postprocess_init(&pp_params, &info);

