2025-fin-graduate-project/Falling-Detection-STM32/Application/STM32N6570-DK/Src/main.c
  /*** Pose pipeline Init *****************************************************/
  PosePipeline_Init(&pose_pipeline);
  pose_last_tick = HAL_GetTick();

  /*** Camera Init ************************************************************/
  CameraPipeline_Init(&lcd_bg_area.XSize, &lcd_bg_area.YSize, &pitch_nn);

  LCD_init();

  /* Start LCD Display camera pipe stream */
  CameraPipeline_DisplayPipe_Start(lcd_bg_buffer, CMW_MODE_CONTINUOUS);

  /*** App Loop ***************************************************************/
  while (1)
  {
    CameraPipeline_IspUpdate();

    if (pitch_nn != (STAI_NETWORK_IN_1_WIDTH * STAI_NETWORK_IN_1_CHANNEL))
    {
      /* Start NN camera single capture Snapshot */
      CameraPipeline_NNPipe_Start(dcmipp_out_nn, CMW_MODE_SNAPSHOT);
    }
    else
    {
      /* Start NN camera single capture Snapshot */
      SCB_InvalidateDCache_by_Addr(nn_in, nn_in_len);
      CameraPipeline_NNPipe_Start(nn_in, CMW_MODE_SNAPSHOT);
    }

    while (cameraFrameReceived == 0) {};
    cameraFrameReceived = 0;

    uint32_t ts[2] = { 0 };

    if (pitch_nn != (STAI_NETWORK_IN_1_WIDTH * STAI_NETWORK_IN_1_CHANNEL))
    {
      SCB_InvalidateDCache_by_Addr(dcmipp_out_nn, sizeof(dcmipp_out_nn));
    /*
     * Crop the image if the neural network (NN) input dimensions are not a multiple of 16.
     * The DCMIPP hardware requires the output image dimensions to be multiples of 16.
     * This ensures compatibility with the NN input dimensions.
     */
      img_crop(dcmipp_out_nn, nn_in, pitch_nn, STAI_NETWORK_IN_1_WIDTH, STAI_NETWORK_IN_1_HEIGHT, STAI_NETWORK_IN_1_CHANNEL);
      SCB_CleanInvalidateDCache_by_Addr(nn_in, nn_in_len);
    }
    else
    {
      SCB_InvalidateDCache_by_Addr(nn_in, nn_in_len);
    }

    ts[0] = HAL_GetTick();
    /* run ATON inference */
    Run_Inference(network_context);
    ts[1] = HAL_GetTick();

    for (int i = 0; i < number_output; i++)
    {
      SCB_InvalidateDCache_by_Addr(nn_out[i], nn_out_len[i]);
    }

    int32_t ret = app_postprocess_run((void **) nn_out, number_output, &pp_output, &pp_params);
    pose_debug_metrics.postprocess_status = ret;
    Update_PoseDebugMetrics(nn_out, nn_out_len, number_output, &pp_output);

    /* --- Pose pipeline (2프레임마다 1회 = 30fps 카메라 → 15fps 윈도우) ------- */
    static uint32_t pipeline_frame_count = 0;
    pipeline_frame_count++;

    pose_debug_metrics.postprocess_valid = ((ret == AI_SPE_POSTPROCESS_ERROR_NO) &&
                                            (pp_output.pOutBuff != NULL)) ? 1u : 0u;

    /* --- Presence State Machine --- */
    if (pose_debug_metrics.postprocess_valid != 0u)
    {
      if (pose_debug_metrics.person_present != 0u)
      {
        /* Entry logic: Need consecutive frames to confirm */
        pose_debug_metrics.person_missing_count = 0u;
        if (pose_debug_metrics.person_present_confirmed == 0u)
        {
          pose_debug_metrics.person_entry_count++;
          if (pose_debug_metrics.person_entry_count >= FALL_PERSON_ENTRY_CONF_COUNT)
          {
            pose_debug_metrics.person_present_confirmed = 1u;
            pose_debug_metrics.person_missing_confirmed = 0u;
          }
        }
      }
      else
      {
        /* Exit logic: Need consecutive frames to confirm missing */
        pose_debug_metrics.person_entry_count = 0u;
        if (pose_debug_metrics.person_present_confirmed != 0u)
        {
          pose_debug_metrics.person_missing_count++;
          if (pose_debug_metrics.person_missing_count >= FALL_PERSON_MISSING_RESET_COUNT)
          {
            pose_debug_metrics.person_present_confirmed = 0u;
            pose_debug_metrics.person_missing_confirmed = 1u;
          }
        }
        else
        {
          pose_debug_metrics.person_missing_confirmed = 1u;
        }
      }
    }

    uint8_t pose_valid = ((pose_debug_metrics.postprocess_valid != 0u) &&
                          (pose_debug_metrics.person_present_confirmed != 0u)) ? 1u : 0u;
    
    /* Visualization depends on the confirmed presence state */
    pose_debug_metrics.draw_keypoints = ((pose_debug_metrics.postprocess_valid != 0u) &&
                                         (pose_debug_metrics.person_present_confirmed != 0u) &&
                                         (pose_debug_metrics.visible_keypoints > 0u)) ? 1u : 0u;

    if ((pose_valid != 0u) && (pipeline_frame_count % 2 == 0))
    {
      uint32_t now_tick = HAL_GetTick();
      float32_t dt_s = (float32_t)(now_tick - pose_last_tick) * 1e-3f;
      if (dt_s <= 0.0f || dt_s > 1.0f) dt_s = 1.0f / 15.0f;
      pose_last_tick = now_tick;

      PoseFeatureVec_t feat_vec;
      PosePipeline_Process(&pose_pipeline, pp_output.pOutBuff, dt_s, &feat_vec);
      FallDetection_Update(&pose_pipeline);
    }
    else if (pose_valid == 0u)
    {
      FallDetection_Invalidate(&pose_pipeline);
    }

    Display_NetworkOutput(&pp_output, ts[1] - ts[0]);
  }
}


static void Hardware_init(void)
{
  /* Power on ICACHE */
  MEMSYSCTL->MSCR |= MEMSYSCTL_MSCR_ICACTIVE_Msk;

  /* Set back system and CPU clock source to HSI */
  __HAL_RCC_CPUCLK_CONFIG(RCC_CPUCLKSOURCE_HSI);
  __HAL_RCC_SYSCLK_CONFIG(RCC_SYSCLKSOURCE_HSI);

  HAL_Init();

  SCB_EnableICache();

#if defined(USE_DCACHE)
  /* Power on DCACHE */
  MEMSYSCTL->MSCR |= MEMSYSCTL_MSCR_DCACTIVE_Msk;
  SCB_EnableDCache();
#endif

  SystemClock_Config();

  CONSOLE_Config();

  NPURam_enable();

  Fuse_Programming();

  NPUCache_config();

  /*** External RAM and NOR Flash *********************************************/
  BSP_XSPI_RAM_Init(0);
  BSP_XSPI_RAM_EnableMemoryMappedMode(0);

  BSP_XSPI_NOR_Init_t NOR_Init;
  NOR_Init.InterfaceMode = BSP_XSPI_NOR_OPI_MODE;
  NOR_Init.TransferRate = BSP_XSPI_NOR_DTR_TRANSFER;
  BSP_XSPI_NOR_Init(0, &NOR_Init);
  BSP_XSPI_NOR_EnableMemoryMappedMode(0);

  /* Set all required IPs as secure privileged */
  Security_Config();

  IAC_Config();
  set_clk_sleep_mode();

}

static void Run_Inference(stai_network *network_instance) {
  stai_return_code ret;

  do {
    ret = stai_network_run(network_instance, STAI_MODE_ASYNC);
    if (ret == STAI_RUNNING_WFE)
      LL_ATON_OSAL_WFE();
  } while (ret == STAI_RUNNING_WFE || ret == STAI_RUNNING_NO_WFE);

  ret = stai_ext_network_new_inference(network_instance);
  assert(ret == STAI_SUCCESS);
}

static void Run_FallInference(void) {
  stai_return_code ret;

#if FALL_DETECTION_MODEL == FALL_MODEL_GRU
  ret = stai_gru_network_run(gru_network_context, STAI_MODE_SYNC);
#else
  do {
    ret = stai_tcn_network_run(tcn_network_context, STAI_MODE_ASYNC);
    if (ret == STAI_RUNNING_WFE)
      LL_ATON_OSAL_WFE();
  } while (ret == STAI_RUNNING_WFE || ret == STAI_RUNNING_NO_WFE);
  ret = stai_ext_tcn_network_new_inference(tcn_network_context);
#endif

