2025-fin-graduate-project/Falling-Detection-STM32/Application/STM32N6570-DK/Src/main.c
  if ((number_output > 0) && (nn_out[0] != NULL) && (nn_out_len[0] > 0))
  {
    int8_t *raw_output = (int8_t *)nn_out[0];
    int32_t raw_len = nn_out_len[0];
    int8_t raw_min = raw_output[0];
    int8_t raw_max = raw_output[0];

    for (int32_t i = 1; i < raw_len; i++)
    {
      if (raw_output[i] < raw_min)
      {
        raw_min = raw_output[i];
      }
      if (raw_output[i] > raw_max)
      {
        raw_max = raw_output[i];
      }
    }

    pose_debug_metrics.raw_min = raw_min;
    pose_debug_metrics.raw_max = raw_max;
    pose_debug_metrics.raw_min_dequant = pp_params.raw_scale * (float32_t)((int32_t)raw_min - (int32_t)pp_params.raw_zero_point);
    pose_debug_metrics.raw_max_dequant = pp_params.raw_scale * (float32_t)((int32_t)raw_max - (int32_t)pp_params.raw_zero_point);
  }

  if ((p_postprocess != NULL) && (p_postprocess->pOutBuff != NULL))
  {
    /* Collect confidence scores from the raw postprocess output for presence logic.
     * We don't use the smoothed features from the pipeline here to avoid a deadlock
     * where the pipeline doesn't update because no person is present, and no person
     * is present because the pipeline isn't updating. */
    float32_t scores[POSE_KP_COUNT];
    for (uint32_t i = 0; i < POSE_KP_COUNT; i++)
    {
      float32_t proba = p_postprocess->pOutBuff[i].proba;
      scores[i] = proba;

      if (proba > pose_debug_metrics.max_keypoint_proba)
      {
        pose_debug_metrics.max_keypoint_proba = proba;
      }
      if (proba >= AI_POSE_PP_CONF_THRESHOLD)
      {
        pose_debug_metrics.visible_keypoints++;
      }
      if (proba >= FALL_PERSON_CONF_THRESHOLD)
      {
        pose_debug_metrics.person_keypoints++;
      }
    }

    /* Robust Presence: Top-5 Average Confidence. 
     * If at least 5 keypoints are detected with some confidence, 
     * their average must be above threshold. */
    for (int i = 0; i < 5; i++)
    {
      for (int j = i + 1; j < POSE_KP_COUNT; j++)
      {
        if (scores[j] > scores[i])
        {
          float32_t tmp = scores[i];
          scores[i] = scores[j];
          scores[j] = tmp;
        }
      }
    }

    float32_t top5_avg = (scores[0] + scores[1] + scores[2] + scores[3] + scores[4]) / 5.0f;

    /* Presence to block noise: 
     * either one best point >= 0.18 or top-5 avg >= 0.07. */
    pose_debug_metrics.person_present = (scores[0] >= 0.18f || top5_avg >= 0.07f) ? 1u : 0u;
  }
}

static void LCD_init(void)
{
  BSP_LCD_Init(0, LCD_ORIENTATION_LANDSCAPE);

  /* Preview layer Init */
  LayerConfig.X0          = lcd_bg_area.X0;
  LayerConfig.Y0          = lcd_bg_area.Y0;
  LayerConfig.X1          = lcd_bg_area.X0 + lcd_bg_area.XSize;
  LayerConfig.Y1          = lcd_bg_area.Y0 + lcd_bg_area.YSize;
  LayerConfig.PixelFormat = LCD_PIXEL_FORMAT_RGB565;
  LayerConfig.Address     = (uint32_t) lcd_bg_buffer;

  BSP_LCD_ConfigLayer(0, LTDC_LAYER_1, &LayerConfig);

  LayerConfig.X0 = lcd_fg_area.X0;
  LayerConfig.Y0 = lcd_fg_area.Y0;
  LayerConfig.X1 = lcd_fg_area.X0 + lcd_fg_area.XSize;
  LayerConfig.Y1 = lcd_fg_area.Y0 + lcd_fg_area.YSize;
  LayerConfig.PixelFormat = LCD_PIXEL_FORMAT_ARGB4444;
  LayerConfig.Address = (uint32_t) lcd_fg_buffer; /* External XSPI1 PSRAM */

  BSP_LCD_ConfigLayer(0, LTDC_LAYER_2, &LayerConfig);
  UTIL_LCD_SetFuncDriver(&LCD_Driver);
  UTIL_LCD_SetLayer(LTDC_LAYER_2);
  UTIL_LCD_Clear(0x00000000);
  UTIL_LCD_SetFont(&Font20);
  UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_WHITE);

#if POSTPROCESS_TYPE == POSTPROCESS_MPE_YOLO_V8_UI
  Display_mpe_InitFunctions(clamp_point,
                            convert_length,
                            convert_point,
                            Display_binding_line);
#elif POSTPROCESS_TYPE == POSTPROCESS_SPE_MOVENET_UI
  Display_spe_InitFunctions(clamp_point,
                            convert_length,
                            convert_point,
                            Display_binding_line);
#endif
}

/**
 * @brief Displays a Welcome screen
 */
static void Display_WelcomeScreen(void)
{
  static uint32_t t0 = 0;
  if (t0 == 0)
    t0 = HAL_GetTick();

  if (HAL_GetTick() - t0 < 4000)
  {
    /* Draw logo */
    UTIL_LCD_FillRGBRect(300, 100, (uint8_t *) stlogo, 200, 107);

    /* Display welcome message */
    UTIL_LCD_SetBackColor(0x40000000);
    UTIL_LCDEx_PrintfAt(0, LINE(16), CENTER_MODE, "Pose Estimation");
    UTIL_LCDEx_PrintfAt(0, LINE(17), CENTER_MODE, WELCOME_MSG_1);
    UTIL_LCDEx_PrintfAt(0, LINE(18), CENTER_MODE, WELCOME_MSG_2);
    UTIL_LCD_SetBackColor(0);
  }
}

/**
  * @brief  DCMIPP Clock Config for DCMIPP.
  * @param  hdcmipp  DCMIPP Handle
  *         Being __weak it can be overwritten by the application
  * @retval HAL_status
  */
HAL_StatusTypeDef MX_DCMIPP_ClockConfig(DCMIPP_HandleTypeDef *hdcmipp)
{
  RCC_PeriphCLKInitTypeDef RCC_PeriphCLKInitStruct = {0};
  HAL_StatusTypeDef ret = HAL_OK;

  RCC_PeriphCLKInitStruct.PeriphClockSelection = RCC_PERIPHCLK_DCMIPP;
  RCC_PeriphCLKInitStruct.DcmippClockSelection = RCC_DCMIPPCLKSOURCE_IC17;
  RCC_PeriphCLKInitStruct.ICSelection[RCC_IC17].ClockSelection = RCC_ICCLKSOURCE_PLL2;
  RCC_PeriphCLKInitStruct.ICSelection[RCC_IC17].ClockDivider = 3;
  ret = HAL_RCCEx_PeriphCLKConfig(&RCC_PeriphCLKInitStruct);
  if (ret)
  {
    return ret;
  }

  RCC_PeriphCLKInitStruct.PeriphClockSelection = RCC_PERIPHCLK_CSI;
  RCC_PeriphCLKInitStruct.ICSelection[RCC_IC18].ClockSelection = RCC_ICCLKSOURCE_PLL1;
  RCC_PeriphCLKInitStruct.ICSelection[RCC_IC18].ClockDivider = 40;
  ret = HAL_RCCEx_PeriphCLKConfig(&RCC_PeriphCLKInitStruct);
  if (ret)
  {
    return ret;
  }

  return ret;
}

static void SystemClock_Config(void)
{
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_PeriphCLKInitTypeDef RCC_PeriphCLKInitStruct = {0};

  /* Ensure VDDCORE=0.9V before increasing the system frequency */
  BSP_SMPS_Init(SMPS_VOLTAGE_OVERDRIVE);

  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_NONE;

  /* PLL1 = 64 x 25 / 2 = 800MHz */
  RCC_OscInitStruct.PLL1.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL1.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL1.PLLM = 2;
  RCC_OscInitStruct.PLL1.PLLN = 25;
  RCC_OscInitStruct.PLL1.PLLFractional = 0;
  RCC_OscInitStruct.PLL1.PLLP1 = 1;
  RCC_OscInitStruct.PLL1.PLLP2 = 1;

